/**
 * Напишіть програму під назвою Фібоначчі для друку перших 20 чисел Фібоначчі.
 * Також обчисліть їх середнє значення. Результат має виглядати так:
 * The first 20 Fibonacci numbers are:
 * 1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765
 * The average is 885.5
 */

public class HW2_Task4 {
    /**
     * Ряд чисел Фібоначчі починається із двох одиниць.
     * Далі кожне наступне число дорівнює сумі двох попередніх чисел.
     *
     * a - позаминуле число
     * b - минуле число
     * c - нове число, яке є сумою минулого та позаминулого числа
     * sum - сума чисел усього ряду
     */
    public static void main(String[] args) {
        int c, a = 1, b = 1, sum = 1;
        System.out.print(a + " ");
        for (int i = 1; i < 20; i++) {
            System.out.print(b + " ");
            sum += b;
            c = a + b;
            a = b;
            b = c;
        }
        System.out.println("\nСереднє значення ціх чисел = " + (sum / 20.0));
    }
}